# FamilyManager Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..FamilyManager Property
Document Class See Also
---
The family manager object provides access to family types and parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyManager FamilyManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyManager As FamilyManager
	Get
```

Visual C++
---
```text
public:
property FamilyManager^ FamilyManager {
	FamilyManager^ get ();
}
```

# Remarks
This property is available when the document is a family document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current document is project document. |

# See Also
Document Class
Autodesk.Revit.DB Namespace